t21/Walnut_X/Packages/.cache/Keil.EZR32LG_DFP.1.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EZR32LG_DFP</name>
  <description>Silicon Labs EZR32 Leopard Gecko Series Device Support</description>

  <releases>
    <release version="1.1.0" date="2016-04-22">
      Updated device support files to V4.2.1.
      Added emlib, emdrv to V4.2.1.
    </release>
    <release version="1.0.0" date="2015-04-29">
      Initial Release version of EZR32LG Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EZR32LG</keyword>
    <keyword>EZR32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EZR32LG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="48000000"/>

      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <!--book name="Documents/EZR32-Cortex-M3-RM.pdf"      title="EZR32 Cortex-M3 Reference Manual"/-->
      <book name="Documents/EZR32LG-RM.pdf"              title="EZR32LG Reference Manual"/>
      <description>
The EZR32LG 32-bit Wireless MCUs are highly integrated, low-power wireless MCUs delivering a high-performance wireless solution, integrated into a small form factor package.
The EZR32LG family provides the ultimate in flexibility with a family of pin-compatible parts that scale from 64 to 256 kB of flash, with or without USB interface, as well as various transceiver options and RF output power levels.
The ultra low power operating modes and fast wake-up times of the Silicon Labs energy friendly 32-bit MCUs, combined with the low standby, transmit and receive power consumption of the sub-GHz radio, result in a wireless solution optimized for battery powered applications.
      </description>

      <!-- ************************  Subfamily 'EZR32LG230 R55'  **************************** -->
      <subFamily DsubFamily="EZR32LG230 R55">
        <book name="Documents/EZR32LG230_DataSheet.pdf" title="EZR32LG230 Data Sheet"/>

        <feature type="IOs"           n="41"                     name="General Purpose I/O pins"/>
        <feature type="ExtInt"        n="16"                     name="External Interrupts"/>
        <feature type="DMA"           n="12"                     name="Central DMA Controller"/>
        <feature type="Crypto"        n="128.256"                name="Advanced Encryption Standard (AES)"/>
        <feature type="SPI"           n="2"                      name="Serial Peripheral Interface (SPI)"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="UART"          n="2"                      name="Low Energy UART Interface"/>
        <feature type="I2C"           n="2"                      name="I2C Interface with SMBus support"/>
        <feature type="Timer"         n="4"        m="16"        name="Timer"/>
        <feature type="Timer"         n="1"        m="16"        name="Low Energy Timer"/>
        <feature type="Timer"         n="1"        m="24"        name="Real-Time Counter"/>
        <feature type="Timer"         n="1"        m="32"        name="Real-Time Counter"/>
        <feature type="TimerOther"    n="3"                      name="8/16-bit Pulse Counter"/>
        <feature type="WDT"           n="1"                      name="Watchdog Timer with dedicated RC oscillator"/>
        <feature type="RTC"           n="32768"                  name="Real Time Counter (RTC)"/>
        <feature type="ADC"           n="8"        m="12"        name="ADC"/>
        <feature type="DAC"           n="2"        m="12"        name="DAC"/>
        <feature type="TempSens"      n="1"                      name="Temperature Sensor"/>
        <feature type="AnalogOther"   n="3"                      name="Operational Amplifier"/>
        <feature type="AnalogOther"   n="2"                      name="Analog Comparator"/>
        <feature type="AnalogOther"   n="1"                      name="Supply Voltage Comparator"/>
        <feature type="Other"         n="1"                      name="Low Energy Sensor Interface (LESENSE)"/>
        <feature type="Other"         n="1"                      name="RF Module"/>
        <feature type="VCC"           n="1.98"     m="3.8"       name="Single supply voltage"/>
        <feature type="Temp"          n="-40"      m="85"        name="Extended Operating Temperature Range"/>
        <feature type="QFN"           n="64"                     name="QFN Package"/>

        <!-- *************************  Device 'EZR32LG230F64R55'  ***************************** -->
        <device Dname="EZR32LG230F64R55">
          <compile header="Device/EZR32LG/Include/em_device.h"  define="EZR32LG230F64R55"/>
          <debug svd="SVD/EZR32LG/EZR32LG230F64R55.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EZR32LG230F128R55'  ***************************** -->
        <device Dname="EZR32LG230F128R55">
          <compile header="Device/EZR32LG/Include/em_device.h"  define="EZR32LG230F128R55"/>
          <debug svd="SVD/EZR32LG/EZR32LG230F128R55.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

